; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v7 - type_2 ?v8 - type_1)
 	      (pred_2 ?v1 - object ?v8 - type_1)
	      (pred_3 ?v7 - type_2 ?v3 - type_3)
	      (pred_4 ?v7 - type_2 ?v1 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v7 - type_2 ?v4 ?v5 - type_1)
       :precondition (and  (pred_1 ?v7 ?v4))
       :effect (and  (pred_1 ?v7 ?v5)
		     (not (pred_1 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_2 ?v6 - object ?v2 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2) (pred_1 ?v7 ?v2) (pred_3 ?v7 ?v3))
       :effect (and (pred_4 ?v7 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v2)) 
		    (not (pred_3 ?v7 ?v3))))

   (:action op_1
       :parameters (?v7 - type_2 ?v6 - object ?v2 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v6 ?v3) (pred_1 ?v7 ?v2))
       :effect (and (pred_2 ?v6 ?v2)
		    (pred_3 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v6 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_08 obj_09 - type_3
obj_07 obj_02 obj_01 - type_1
obj_05 obj_03 obj_06 - object)
(:init
(pred_1 obj_04 obj_07)
(pred_3 obj_04 obj_08)
(pred_3 obj_04 obj_09)
(pred_2 obj_05 obj_07)
(pred_2 obj_03 obj_01)
(pred_2 obj_06 obj_01)
)
(:goal
(and
(pred_2 obj_05 obj_02)
(pred_2 obj_03 obj_02)
(pred_2 obj_06 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_04 ?b obj_09))))
)
)

; plan
1. (op_2 obj_04 obj_05 obj_07 obj_08)
   deleted: (pred_2 obj_05 obj_07) (pred_3 obj_04 obj_08)
   added: (pred_4 obj_04 obj_05 obj_08)
   goals met: 1 of 3
2. (op_3 obj_04 obj_07 obj_02)
   deleted: (pred_1 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02)
   goals met: 1 of 3
3. (op_1 obj_04 obj_05 obj_02 obj_08)
   deleted: (pred_4 obj_04 obj_05 obj_08)
   added: (pred_2 obj_05 obj_02) (pred_3 obj_04 obj_08)
   goals met: 2 of 3
4. (op_3 obj_04 obj_02 obj_01)
   deleted: (pred_1 obj_04 obj_02)
   added: (pred_1 obj_04 obj_01)
   goals met: 2 of 3
5. (op_2 obj_04 obj_03 obj_01 obj_08)
   deleted: (pred_2 obj_03 obj_01) (pred_3 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03 obj_08)
   goals met: 2 of 3
6. (op_3 obj_04 obj_01 obj_02)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_02)
   goals met: 2 of 3
7. (op_1 obj_04 obj_03 obj_02 obj_08)
   deleted: (pred_4 obj_04 obj_03 obj_08)
   added: (pred_2 obj_03 obj_02) (pred_3 obj_04 obj_08)
   goals met: 3 of 3
